tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/services'
tap 'homebrew/dupes'

# Tools
cask 'karabiner'
cask 'google-japanese-ime'
cask 'google-drive'
cask 'alfred'
cask 'keepassx'
cask 'dropbox'
cask 'cyberduck'
cask 'appcleaner'
cask 'bestres'
cask 'libreoffice'
cask 'paintbrush'
cask 'openoffice'
cask 'franz'

# Terminal
cask 'iterm2'

# Browser
cask 'firefox'
# cask 'google-chrome'

# Editor
cask 'atom'
cask 'coteditor'
# cask 'rubymine7'

# Shell
brew 'zsh'

# Git
brew 'git'
brew 'git-flow'
brew 'bash-completion'

# Utility
brew 'wget'
brew 'ctags'
brew 'zsh-syntax-highlighting'
brew 'imagemagick'

# Ruby
brew 'rbenv'
brew 'rbenv-gemset'
brew 'ruby-build'

# Java
cask 'java' # Java8
cask 'java7'
cask 'java6'

# Database
brew 'sqlite'
brew 'mongodb'
brew 'postgresql'
brew 'mysql'
brew 'homebrew/versions/mysql55'

# Others
brew 'openssl'
brew 'readline'
brew 'libxml2'
brew 'libxslt'
brew 'homebrew/dupes/libiconv'
brew 'v8'
brew 'apple-gcc42'
brew 'phantomjs'
brew 'rename'
brew 'imagemagick'
brew 'doxygen'
brew 'graphviz'
brew 'qt55'

# Node
brew 'node'

# Heroku
brew 'heroku-toolbelt'
